#pragma once

static const char *instruction_text = "欢迎来到我的农场~\n"
"\n"
"	农场总体分为四个大部分：种植养殖、贸易往来、小镇管理、爬塔通关。\n"
"\n"
"	种植养殖分为五大类：农场、牧场、池塘、果园、花园，外加与其相关的工厂、研究院。\n"
"	贸易往来分为四大类：卡车订单、火车采购、飞机快递、货轮进货。\n"
"	小镇管理分为四大类：镇中心、基础建设、法律、旅游业。\n"
"	爬塔通关一共有32层，通关之后获得火箭原材料电子核心。\n"
"\n"
"\n"
"\n"
"\n"
"\n"
"";

static const char *upgrade_text[60] = {
	"解锁区块：种植(+6)、劳动\n"
	"解锁物品：小麦(种植)、\n"
	"                 柴火(劳动/木材采集与加工)",//1

	"解锁区块：种植(+3)\n"
	"解锁物品：玉米(种植)、\n"
	"                 面粉(劳动/磨坊与烘焙坊)",//2

	"解锁区块：种植(+3)\n"
	"解锁物品：木棚(劳动/木材采集与加工)、\n"
	"                 面包(劳动/磨坊与烘焙坊)",//3

	"解锁区块：种植(+3)、养殖(+1)\n"
	"解锁物品：鸡蛋(养殖)、鸡肉(养殖)、\n"
	"                 鸡饲料(劳动/饲料厂)",//4

	"解锁区块：种植(+3)\n"
	"解锁物品：锄头(劳动/木材采集与加工)、\n"
	"                 饼干(劳动/磨坊与烘焙坊)",//5

	"解锁区块：种植(+3)、养殖(+1)\n"
	"解锁物品：牛奶(养殖)、牛肉(养殖)、\n"
	"                 牛饲料(劳动/饲料厂)",//6

	"解锁区块：种植(+3)\n"
	"解锁物品：奶油(劳动/乳制品厂)、\n"
	"                 泡芙(劳动/磨坊与烘焙坊)",//7

	"解锁区块：种植(+3)\n"
	"解锁物品：萝卜(种植)、\n"
	"                 奶酪(劳动/乳制品厂)",//8

	"解锁区块：种植(+3)、养殖(+1)\n"
	"解锁物品：蘑菇(养殖)、猪肉(养殖)、\n"
	"                 猪饲料(劳动/饲料厂)",//9

	"解锁区块：种植(+3)\n"
	"解锁物品：大豆(种植)、\n"
	"                 醋(劳动/调料厂)",//10

	"解锁区块：种植(+3)\n"
	"解锁物品：甘蔗(种植)、\n"
	"                 酱油(劳动/调料厂)",//11

	"解锁区块：种植(+3)\n"
	"解锁物品：黄油(劳动/乳制品厂)、\n"
	"                 白糖(劳动/调料厂)",//12

	"解锁区块：种植(+3)\n"
	"解锁物品：棉花(种植)、\n"
	"                 蛋糕(劳动/磨坊与烘焙坊)",//13

	"解锁区块：种植(+3)\n"
	"解锁物品：披萨(劳动/磨坊与烘焙坊)、\n"
	"                 棉布(劳动/纺织厂)",//14

	"解锁区块：种植(+3)、池塘、养殖(+1)\n"
	"解锁物品：土豆(种植)、\n"
	"                 鱼肉(池塘)",//15

	"解锁区块：种植(+3)、果园\n"
	"解锁物品：苹果(果园)、\n"
	"                 土豆粉(劳动/磨坊与烘焙坊)",//16

	"解锁区块：种植(+3)\n"
	"解锁物品：辣椒(种植)、\n"
	"                 糖浆(劳动/调料厂)",//17

	"解锁区块：种植(+3)、花园\n"
	"解锁物品：狗尾草(花园)、\n"
	"                 辣酱(劳动/调料厂)",//18

	"解锁区块：种植(+3)\n"
	"解锁物品：桃子(果园)、\n"
	"                 蒲公英(花园)",//19

	"解锁区块：种植(+3)、养殖(+1)\n"
	"解锁物品：羊毛(养殖)、羊肉(养殖)\n"
	"                 羊饲料(劳动/饲料厂)",//20

	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
};