#pragma once
#include "clock.h"
#include <string>
#include <vector>
#include <deque>

#define WORK_TYPES 15

using std::vector;
using std::deque;
using std::map;

enum WORK_TYPE {
	WORK_WOOD,
	WORK_BAKERY,
	WORK_FEED,
	WORK_MILK,
	WORK_FLAVOR,
	WORK_SPIN,
	WORK_FLOWER,
	WORK_CLOTH,
	WORK_CONSTRUCT,
	WORK_MEAT,
	WORK_DECORATE,
	WORK_DRINK,
	WORK_INDUSTRY,
	WORK_FIRE,
	WORK_DIAMOND
};
enum MANUAL_TYPE {
	MANUAL_FIREWOOD,
	MANUAL_WOODHOUSE,
	MANUAL_HOE,
	MANUAL_WOODPLANE,
	MANUAL_PAPER,
	MANUAL_BOAT,

	MANUAL_FLOWER,
	MANUAL_BREAD,
	MANUAL_COOKIE,
	MANUAL_PUFF,
	MANUAL_CAKE,
	MANUAL_PIZZA,
	MANUAL_STARCH,
	MANUAL_FRUITPIE,

	MANUAL_CHICKENFEED,
	MANUAL_COWFEED,
	MANUAL_PIGFEED,
	MANUAL_SHEEPFEED,
	MANUAL_DUCKFEED,

	MANUAL_CREAM,
	MANUAL_CHEESE,
	MANUAL_BUTTER,
	MANUAL_SALAD,
	MANUAL_YOGURT,

	MANUAL_VENEGAR,
	MANUAL_SOY,
	MANUAL_SUGAR,
	MANUAL_SYRUP,
	MANUAL_PEPPERSAUCE,
	MANUAL_TOMATOSAUCE,
	MANUAL_PEANUTSAUCE,

	MANUAL_CUTTON,
	MANUAL_WOOL,
	MANUAL_BANDAGE,
	MANUAL_WEAVE,
	MANUAL_SILK,
	MANUAL_NET,

	MANUAL_ROSEBUNDLE,
	MANUAL_POTTED,
	MANUAL_MIXBUNDLE,
	MANUAL_PERFUME,
	MANUAL_PETAL,

	MANUAL_CLOTHES,
	MANUAL_SWEATER,
	MANUAL_SHOES,
	MANUAL_SUIT,
	MANUAL_DOWN,
	MANUAL_TRAINER,
	MANUAL_DRESS,
	MANUAL_BAG,
	MANUAL_ARMER,
	MANUAL_HELMET,

	MANUAL_STONE,
	MANUAL_HOUSE,
	MANUAL_VILLA,
	MANUAL_SAND,
	MANUAL_ARBOR,
	MANUAL_ASPHALT,
	MANUAL_PARK,
	MANUAL_DEPARTMENT,

	MANUAL_BACON,
	MANUAL_BEAF,
	MANUAL_POPCORN,
	MANUAL_CHOCOLATE,
	MANUAL_ICECREAM,
	MANUAL_FRUITPLATE,

	MANUAL_LANTERN,
	MANUAL_DOOR,
	MANUAL_BASKET,
	MANUAL_SANTATREE,
	MANUAL_STATUE,

	MANUAL_BEER,
	MANUAL_LAMONADE,
	MANUAL_MIXFRUIT,
	MANUAL_MELONADE,
	MANUAL_USCOFFEE,
	MANUAL_MILKTEA,

	MANUAL_COAL,
	MANUAL_PLAST,
	MANUAL_IRON,
	MANUAL_CARBON,
	MANUAL_GOLDBAR,
	MANUAL_ROCKET,

	MANUAL_KNIFE,
	MANUAL_BOW,
	MANUAL_BOMB,
	MANUAL_PISTOL,
	MANUAL_AUTOGUN,
	MANUAL_CANNON,
	MANUAL_TANK,
	MANUAL_FLIGHT,

	MANUAL_RING,
	MANUAL_NECKLACE,
	MANUAL_BRACELET,
	MANUAL_EARRING,
	MANUAL_HAIRPIN
};
static vector<string>MANUAL_NAME = {
	"木柴",
	"木棚",
	"锄头",
	"木板",
	"纸",
	"木筏",

	"面粉",
	"面包",
	"饼干",
	"泡芙",
	"蛋糕",
	"披萨",
	"土豆粉",
	"水果派",

	"鸡饲料",
	"牛饲料",
	"猪饲料",
	"羊饲料",
	"鸭饲料",

	"奶油",
	"奶酪",
	"黄油",
	"沙拉酱",
	"酸奶",

	"醋",
	"酱油",
	"白糖",
	"糖浆",
	"辣酱",
	"番茄酱",
	"花生酱",

	"棉布",
	"毛线",
	"绷带",
	"织布",
	"丝绸",
	"渔网",

	"玫瑰束",
	"盆栽",
	"混合花束",
	"香水",
	"金银花瓣",

	"衬衣",
	"毛衣",
	"布鞋",
	"西装",
	"羽绒服",
	"运动鞋",
	"晚礼服",
	"背包",
	"铠甲",
	"头盔",

	"石块",
	"平房",
	"别墅",
	"砂砾",
	"凉亭",
	"沥青",
	"公园",
	"公寓",

	"培根",
	"牛排",
	"爆米花",
	"巧克力",
	"冰淇淋",
	"鲜果捞",

	"南瓜灯",
	"拱门",
	"花篮",
	"圣诞树",
	"雕像",

	"啤酒",
	"柠檬水",
	"混合果汁",
	"西瓜汁",
	"美式咖啡",
	"奶茶",

	"煤炭",
	"塑料",
	"铁锭",
	"金刚石",
	"金条",
	"火箭",

	"匕首",
	"弓箭",
	"手雷",
	"手枪",
	"冲锋枪",
	"意大利炮",
	"坦克",
	"飞行器",

	"钻石戒指",
	"项链",
	"手镯",
	"耳环",
	"金钗",
};
static vector<map<string, int>>MANUAL_PREV = {
	{},//木柴 2*5
	{ { "木柴", 6 } },//木棚 1*40
	{ { "木柴", 1 } },//锄头 4*1
	{ { "木柴", 2 } },//木板 5*2
	{ { "木柴", 2 }, { "茉莉", 1 } },//纸 10*1
	{ { "木柴", 2 }, { "木板", 6 }, { "塑料", 1}},//木筏 1*30

	{ { "小麦", 4 } },//面粉 3*1
	{ { "面粉", 2 } },//面包 1*1
	{ { "面粉", 1 } },//饼干 1*1
	{ { "面粉", 1 }, { "奶油", 1 } },//泡芙 1*1
	{ { "面粉", 1 }, { "奶油", 1 }, { "鸡蛋", 1 },{ "白糖", 1 } },//蛋糕 1*1
	{ { "面粉", 1 }, { "鸡肉", 1 }, { "奶酪", 1 }, { "大豆", 1 }, },//披萨 1*1
	{ { "面粉", 1 }, { "土豆", 2 }, },//土豆粉 1*1
	{ { "面粉", 1 }, { "苹果", 1 }, { "香蕉", 1 }, { "樱桃", 1 } },//水果派 1*1

	{ { "小麦", 1 }, { "玉米", 1 } },//鸡饲料 3*1
	{ { "小麦", 2 }, { "玉米", 1 } },//牛饲料 3*1
	{ { "玉米", 1 }, { "萝卜", 4 } },//猪饲料 4*1
	{ { "小麦", 2 }, { "大豆", 1 }, },//羊饲料 3*1
	{ { "小麦", 1 }, { "鱼", 2 }, },//鸭饲料 3*1

	{ { "牛奶", 1 } },//奶油 1*1
	{ { "牛奶", 4 } },//奶酪 1*1
	{ { "牛奶", 2 } },//黄油 1*1
	{ { "牛奶", 1 }, { "白糖", 1 } },//沙拉酱 1*1
	{ { "牛奶", 2 } },//酸奶1*1

	{ { "玉米", 1 } },//醋 1*1
	{ { "大豆", 1 }, },//酱油 1*1
	{ { "甘蔗", 1 }, },//白糖 1*1
	{ { "白糖", 4 }, },//糖浆 1*1
	{ { "辣椒", 1 }, },//辣酱 1*1
	{ { "番茄", 1 }, },//番茄酱 1*1
	{ { "花生", 1 }, },//花生酱 1*1

	{ { "棉花", 1 }, },//棉布 1*1
	{ { "羊毛", 1 }, },//毛线 1*1
	{ { "棉花", 1 }, { "羊毛", 1 }, },//绷带 4*1
	{ { "羊毛", 1 }, { "棉布", 1 } },//织布 2*1
	{ { "毛线", 1 }, { "织布", 1 } },//丝绸 1*1
	{ { "织布", 2 } },//渔网 1*1

	{ { "玫瑰", 9 } },//玫瑰束 1*1
	{ { "兰花", 2 } },//盆栽 1*1
	{ { "薰衣草", 1 }, { "郁金香", 2 }, { "蒲公英", 2 } },//混合花束 1*1
	{ { "茉莉", 3 } },//香水 1*1
	{ { "金银花", 20 } },//金银花瓣 1*1

	{ { "棉布", 2 } },//衬衣 1*1
	{ { "毛线", 2 } },//毛衣 1*1
	{ { "棉布", 2 }, { "毛线", 1 } },//布鞋 1*1
	{ { "织布", 2 }, { "薰衣草", 1 } },//西装 1*1
	{ { "鸭绒", 3 }, { "织布", 1 } },//羽绒服 1*1
	{ { "织布", 2 }, { "橡胶", 1 }, { "毛线", 1 } },//运动鞋 1*1
	{ { "织布", 2 }, { "鸭绒", 1 }, { "金银花瓣", 1 } },//晚礼服 1*1
	{ { "织布", 3 }, { "橡胶", 1 } },//背包 1*1
	{ { "棉布", 1 }, { "铁锭", 2 } },//铠甲 1*1
	{ { "棉布", 1 }, { "铁锭", 1 } },//头盔 1*1

	{},//石块 1*4
	{ { "石块", 8 }, { "木棚", 2 }, { "木柴", 10 } },//平房 1*50
	{ { "石块", 2 }, { "平房", 1 } },//别墅 1*80
	{ { "石块", 3 }, },//砂砾 1*6
	{ { "石块", 1 }, { "砂砾", 2 } },//凉亭 1*12
	{ { "砂砾", 1 } },//沥青 1*2
	{ { "砂砾", 4 }, { "凉亭", 2 }, { "花篮", 2 }, { "雕像", 1 } },//公园 1*80
	{ { "石块", 15 }, { "砂砾", 8 }, { "平房", 10 }, { "塑料", 1 }, { "铁锭", 4 } },//公寓 1*320

	{ { "猪肉", 1 } },//培根 2*1
	{ { "牛肉", 1 } },//牛排 2*1
	{ { "玉米", 2 }, { "黄油", 1 } },//爆米花 1*1
	{ { "可可", 2 }, { "奶油", 1 } },//巧克力 1*1
	{ { "奶油", 2 }, { "白糖", 1 } },//冰淇淋 1*1
	{ { "苹果", 1 }, { "桃子", 1 }, { "香蕉", 1 }, { "樱桃", 1 }, { "葡萄", 1 } },//鲜果捞 1*1

	{ { "南瓜", 2 } },//南瓜灯 1*1
	{ { "织布", 3 }, { "混合花束", 2 } },//拱门 1*2
	{ { "木柴", 1 }, { "混合花束", 3 } },//花篮 1*1
	{ { "木柴", 2 }, { "金银花瓣", 1 } },//圣诞树 1*2
	{ { "石块", 6 }, },//雕像 1*15

	{ { "玉米", 4 }, },//啤酒 1*1
	{ { "柠檬", 2 }, { "白糖", 1 } },//柠檬水 1*1
	{ { "苹果", 1 }, { "桃子", 1 }, { "柠檬", 1 }, { "樱桃", 1 }, { "葡萄", 1 } },//混合果汁 1*1
	{ { "西瓜", 2 }, { "柠檬", 1 } },//西瓜汁 1*1
	{ { "咖啡", 1 }, { "牛奶", 1 },{ "白糖", 1 } },//美式咖啡 1*1
	{ { "茶", 2 }, { "牛奶", 1 }, { "混合果汁", 1 } },//奶茶 1*1

	{},//煤炭 5*2
	{},//塑料 3*2
	{},//铁锭 3*1
	{},//金刚石 1*1
	{ { "金银花瓣", 8 } },//金条 1*1
	{ { "煤炭", 200 }, { "塑料", 32 }, { "铁锭", 12 }, { "金银花瓣", 15 }, { "飞行器", 50 }, { "电子核心", 1 }},//火箭 1*2000

	{ { "铁锭", 2 } },//匕首 1*1
	{ { "铁锭", 1 } },//弓箭 1*1
	{ { "铁锭", 2 }, { "塑料", 1 }, { "金刚石", 1 }, },//手雷 1*1
	{ { "铁锭", 1 }, { "塑料", 2 } },//手枪 1*1
	{ { "铁锭", 2 }, { "塑料", 1 } },//冲锋枪 1*1
	{ { "铁锭", 5 }, { "煤炭", 2 } },//意大利炮 1*2
	{ { "铁锭", 24 }, { "煤炭", 10 } },//坦克 1*8
	{ { "铁锭", 40 }, { "煤炭", 18 } },//飞行器 1*10

	{ { "金刚石", 2 } },//钻石戒指 1*1
	{ { "贝", 10 } },//项链 1*1
	{ { "金刚石", 2 }, { "塑料", 1 } },//手镯 1*1
	{ { "贝", 1 }, { "金条", 1 } },//耳环 1*1
	{ { "金条", 3 } },//金钗 1*1
};
static vector<int>MANUAL_CLASS = {
	0, 0, 0, 0, 0, 0,
	1, 1, 1, 1, 1, 1, 1, 1,
	2, 2, 2, 2, 2,
	3, 3, 3, 3, 3,
	4, 4, 4, 4, 4, 4, 4,
	5, 5, 5, 5, 5, 5,
	6, 6, 6, 6, 6,
	7, 7, 7, 7, 7, 7, 7, 7, 7, 7,
	8, 8, 8, 8, 8, 8, 8, 8,
	9, 9, 9, 9, 9, 9,
	10, 10, 10, 10, 10,
	11, 11, 11, 11, 11, 11,
	12, 12, 12, 12, 12, 12,
	13, 13, 13, 13, 13, 13, 13,
	14, 14, 14, 14, 14
};
static vector<int>MANUAL_TIME = {
	24 * 3600,//木柴
	72 * 3600,//木棚
	4 * 3600,//锄头
	12 * 3600,//木板
	48 * 3600,//纸
	192 * 3600,//木筏

	8 * 3600,//面粉
	3 * 3600,//面包
	6 * 3600,//饼干
	2 * 3600,//泡芙
	8 * 3600,//蛋糕
	1 * 3600,//披萨
	2 * 3600,//土豆粉
	4 * 3600,//水果派

	1 * 3600,//鸡饲料
	3 * 3600,//牛饲料
	8 * 3600,//猪饲料
	14 * 3600,//羊饲料
	22 * 3600,//鸭饲料

	10 * 3600,//奶油
	16 * 3600,//奶酪
	36 * 3600,//黄油
	24 * 3600,//沙拉酱
	96 * 3600,//酸奶

	48 * 3600,//醋
	90 * 3600,//酱油
	16 * 3600,//白糖
	30 * 3600,//糖浆
	10 * 3600,//辣酱
	8 * 3600,//番茄酱
	8 * 3600,//花生酱

	36 * 3600,//棉布
	72 * 3600,//毛线
	2 * 3600,//绷带
	10 * 3600,//织布
	80 * 3600,//丝绸
	30 * 3600,//渔网

	1 * 3600,//玫瑰束
	50 * 3600,//盆栽
	4 * 3600,//混合花束
	60 * 3600,//香水
	200 * 3600,//金银花瓣

	24 * 3600,//衬衣
	120 * 3600,//毛衣
	30 * 3600,//布鞋
	144 * 3600,//西装
	100 * 3600,//羽绒服
	21 * 3600,//运动鞋
	216 * 3600,//晚礼服
	10 * 3600,//背包
	312 * 3600,//铠甲
	90 * 3600,//头盔

	24 * 3600,//石块
	360 * 3600,//平房
	264 * 3600,//别墅
	40 * 3600,//砂砾
	140 * 3600,//凉亭
	30 * 3600,//沥青
	72 * 3600,//公园
	800 * 3600,//公寓

	4 * 3600,//培根
	6 * 3600,//牛排
	1 * 3600,//爆米花
	10 * 3600,//巧克力
	12 * 3600,//冰淇淋
	2 * 3600,//鲜果捞

	2 * 3600,//南瓜灯
	18 * 3600,//拱门
	5 * 3600,//花篮
	3 * 3600,//圣诞树
	400 * 3600,//雕像

	180 * 3600,//啤酒
	1 * 3600,//柠檬水
	2 * 3600,//混合果汁
	1 * 3600,//西瓜汁
	3 * 3600,//美式咖啡
	6 * 3600,//奶茶

	24 * 3600,//煤炭
	40 * 3600,//塑料
	96 * 3600,//铁锭
	216 * 3600,//金刚石
	360 * 3600,//金条
	3000 * 3600,//火箭

	8 * 3600,//匕首
	14 * 3600,//弓箭
	4 * 3600,//手雷
	20 * 3600,//手枪
	42 * 3600,//冲锋枪
	640 * 3600,//意大利炮
	1080 * 3600,//坦克
	800 * 3600,//飞行器

	100 * 3600,//钻石戒指
	60 * 3600,//项链
	320 * 3600,//手镯
	72 * 3600,//耳环
	400 * 3600//金钗
};
static vector<int>MANUAL_AMOUNT = {
	2,	1,	4,	5,	10, 1,
	3,	1,	1,	1,	1,	1,	1,	1,
	3,	3,	4,	3,	3,
	1,	1,	1,	1,	1,
	1,	1,	1,	1,	1,	1,	1,
	1,	1,	4,	2,	1,	1,
	1,	1,	1,	1,	1,
	1,	1,	1,	1,	1,	1,	1,	1,	1,	1,
	1,	1,	1,	1,	1,	1,	1,	1,
	2,	2,	1,	1,	1,	1,
	1,	1,	1,	1,	1,
	1,	1,	1,	1,	1,	1,
	5,	3,	3,	1,	1,	1,
	1,	1,	1,	1,	1,	1,	1,	1,
	1,	1,	1,	1,	1
};
static vector<int>MANUAL_SIZE = {
	5, 40, 1, 2, 1, 30,
	1, 1, 1, 1, 1, 1, 1, 1,
	1, 1, 1, 1, 1,
	1, 1, 1, 1, 1,
	1, 1, 1, 1, 1, 1, 1,
	1, 1, 1, 1, 1, 1,
	1, 1, 1, 1, 1,
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
	4, 50, 80, 6, 12, 2, 80, 320,
	1, 1, 1, 1, 1, 1,
	1, 2, 1, 2, 15,
	1, 1, 1, 1, 1, 1,
	2, 2, 1, 1, 1, 2000,
	1, 1, 1, 1, 1, 2, 8, 10,
	1, 1, 1, 1, 1
};
static vector<int>MANUAL_EXP = {
	1,//木柴
	6,//木棚
	3,//锄头
	20,//木板
	150,//纸
	1200,//木筏

	2,//面粉
	5,//面包
	20,//饼干
	24,//泡芙
	100,//蛋糕
	80,//披萨
	250,//土豆粉
	800,//水果派

	1,//鸡饲料
	5,//牛饲料
	18,//猪饲料
	40,//羊饲料
	96,//鸭饲料

	10,//奶油
	24,//奶酪
	90,//黄油
	108,//沙拉酱
	840,//酸奶

	72,//醋
	240,//酱油
	102,//白糖
	400,//糖浆
	360,//辣酱
	600,//番茄酱
	1040,//花生酱

	50,//棉布
	140,//毛线
	9,//绷带
	88,//织布
	960,//丝绸
	2100,//渔网

	4,//玫瑰束
	340,//盆栽
	75,//混合花束
	1200,//香水
	5100,//金银花瓣

	52,//衬衣
	210,//毛衣
	110,//布鞋
	640,//西装
	800,//羽绒服
	270,//运动鞋
	4200,//晚礼服
	350,//背包
	28800,//铠甲
	15600,//头盔

	45,//石块
	1000,//平房
	1300,//别墅
	510,//砂砾
	3900,//凉亭
	2200,//沥青
	9900,//公园
	128000,//公寓

	16,//培根
	31,//牛排
	9,//爆米花
	144,//巧克力
	320,//冰淇淋
	100,//鲜果捞

	15,//南瓜灯
	190,//拱门
	120,//花篮
	200,//圣诞树
	5200,//雕像

	600,//啤酒
	12,//柠檬水
	35,//混合果汁
	32,//西瓜汁
	170,//美式咖啡
	920,//奶茶

	110,//煤炭
	400,//塑料
	1600,//铁锭
	5300,//金刚石
	19200,//金条
	480000,//火箭

	90,//匕首
	200,//弓箭
	110,//手雷
	840,//手枪
	1900,//冲锋枪
	71000,//意大利炮
	222000,//坦克
	312000,//飞行器

	1500,//钻石戒指
	3200,//项链
	40000,//手镯
	38000,//耳环
	288000//金钗
};

class Workshop {
private:
	WORK_TYPE type;

	deque<int> waiting;
	int current = -1;
	Time time;

public:
	int queueLen = 2;
	vector<int>ready;

	Workshop(WORK_TYPE type) : type(type) {}
	~Workshop() {}

	bool addQueue() { 
		queueLen++;
		if (queueLen < 6)return true;
		else return false;
	}
	void addWork(MANUAL_TYPE item) {
		if (waiting.size() >= queueLen)return;
		waiting.push_back(item);
	}
	void refreshResult(Clock *clk) {
		if (current >= 0) {
			if (*clk > time) {
				for(int i = 0; i < MANUAL_AMOUNT[current]; i++)
					ready.push_back(current);
				current = -1;
			}
		}
		else {
			if (waiting.size() > 0) {
				current = waiting.front();
				waiting.pop_front();
				time = *clk + MANUAL_TIME[current];
			}
		}
	}
	string currentString(Clock *tmp) {
		if (current < 0)return "空闲";
		return MANUAL_NAME[current] + "\n" + Time(time - *tmp).toString();
	}
	int getQueuer(int pos) {
		if (pos >= waiting.size())return -1;
		return waiting[pos];
	}

	int getCurrent() { return current; }
	int getTime() {
		Time start;
		return time - start;
	}
	void setCurrent(MANUAL_TYPE type, int time) {
		current = type;
		this->time = Time() + time;
	}
};
